import React from 'react';

const Home = ({ handleLogout, isAuthenticated }) => {


    return (
        <div>
            <h2>Welcome to the Home Page</h2>
            <p>Наш веб-застосунок надає платформу для фанатів аніме та манги, де вони можуть спілкуватися з авторами та студіями пишучи питання, подяки, критику, пропозиції.</p>
            <p>Для доступу до вебзастосунку треба зареєструватися та залогінитись після чого будуть доступні його розширені функції.</p>
            <h4>Основні функції Anifans</h4>
            <ul>
                <li>Спілкуйтеся з улюбленими авторами та студіями шляхом додавання питання, критики, подяки, пропозиції та отриманням відповідей на них;</li>
                <li>Визначення рейтингу питання, критики, подяки, пропозиції;</li>
                <li>Верифікація авторів та студій;</li>
                <li>Пошук авторів, студій, користувачів;</li>
                <li>Отримання винагород за виконання певної активності.</li>
            </ul>
            <h4>Поведінка користувачів</h4>
            <ul>
                <li>Заборонено розповсюдження образливих, погрозливих або неприйнятних матеріалів;</li>
                <li>Заборонено спам та реклама;</li>
                <li>Користувачі повинні поважати інших членів спільноти та адміністрацію.</li>
            </ul>
            <p>У разі виявлення некоректного вмісту повідомлення, воно буде негайно видалене адміністрацією.</p>
            <h4>Зміни в правилах</h4>
            <p>Ми залишаємо за собою право змінювати ці правила у будь-який час. Користувачі будуть повідомлені про зміни через електронну пошту або шляхом публікації повідомлення на вебзастосунку.</p>
        </div>
    );
};

export default Home;
